---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.IsValid
source: html/cd16099d-1972-068c-6737-e790c4e324ed.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.IsValid Method

Checks if this object is a valid alignment.

## Syntax (C#)
```csharp
public bool IsValid()
```